# # Task 22
# # Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# # Пример:
# # - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# from random import randint

# n = 5
# lst = [0]*n
# sum = 0
# for i in range(n):
#     lst[i] = randint(0, 10)
#     if (i % 2 != 0):
#         sum += lst[i]
# print(lst)
# print(sum)
